cases/00-tutorials/Plate2D/constant/physicalProperties.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel  constant;

nu              0.5e-05;

rho             1.78;


    Tsolidus    1.0;
    Tliquidus   10.0;
    LatentHeat  1;
    beta    4.0e-5;
    
    poly_kappa   (0.4 0.0 0 0 0 0 0 0);
    poly_cp   (520 0.0 0 0 0 0 0 0);

// ************************************************************************* //
